/* 
  Localizable.strings
  CoreSDKTestApp

  Created by Vladimír Nevyhoštěný on 10.11.15.
  Copyright © 2015 Applifting. All rights reserved.
*/

"btn-change-password"                               = "CHANGE PASSWORD";
"btn-ok"                                            = "OK";
"btn-cancel"                                        = "Cancel";


"info-user-is-unregistered"                         = "User is unregistered.";
"info-user-is-registered-and-locked"                = "User is registered and locked.";
"info-user-is-unlocked"                             = "User is unlocked.";
"info-user-is-in-unknown-state"                     = "User is in an unknown state.";

"title-error"                                       = "Error";

"btn-register"                                      = "Register";
"btn-unlock"                                        = "Unlock";
"btn-lock"                                          = "Lock";
"btn-change-locker-status"                          = "Change Locker Status";

"true-value"                                        = "yes";
"false-value"                                       = "no";

"no-data"                                           = "No data";

//LockerUI Demo
"locker-ui-demo"                                    = "LockerUI Demo";

//Transparent Accounts Demo
"transparent-accounts-demo"                         = "TransparentAcc Demo";
"transparent-accounts"                              = "Transparent Accounts";
"transaction"                                       = "Transaction";

"accBankCode"                                       = "Account bank code";
"transparencyFrom"                                  = "Transparency from";
"transparencyTo"                                    = "Transparency to";
"publicationTo"                                     = "Publication to";
"actualizationDate"                                 = "Actualization date";
"balance"                                           = "Balance";
"currency"                                          = "Currency";
"name"                                              = "Name";
"description"                                       = "Description";
"note"                                              = "Note";
"iban"                                              = "Iban";
"accNumber"                                         = "Account number";

"sender"                                            = "Sender";
"receiver"                                          = "Receiver";

//Uniforms Demo
"uniforms-demo"                                     = "Uniforms Demo";
"uniforms"                                          = "Uniforms";

//Places
"places-demo"                                       = "Places Demo";

"types"                                             = "Types";

"no-results"                                        = "No results";
"places"                                            = "Places count";
"my-location"                                       = "My location";
"results"                                           = "Result count";

//App menu
"app-menu-demo"                                     = "AppMenu Demo";

"install"                                           = "Install";
"open"                                              = "Open";

// Netbanking demo
"netbanking-demo"                                   = "Netbanking Demo";
"netbanking-tests"                                  = "Netbanking Tests";

"title-accounts"                                    = "Accounts";
"title-payments"                                    = "Payments";
"title-create-payment"                              = "Create payment";
"title-netbanking-tests"                            = "Netbanking tests";
"title-netbanking-tests-info"                       = "Netbanking test info";
"title-otp"                                         = "OTP";


"nb-domestic-test"                                  = "Domestic payment list test";
"nb-accounts-test"                                  = "Account list test";
"nb-cards-test"                                     = "Card list test";
"nb-account-id-statements-list-test"                = "1st account statements list test";
"nb-account-id-subaccount-id-statements-list-test"  = "1st account 1st subaccount statements list test";
"nb-cards-id-mainaccount-id-statements-list-test"   = "Card with ID main account with ID statements list test";
"nb-profile-test"                                   = "Customer profile get test";
"nb-accounts-withid-standingorders-test"            = "Account standing order list test";
"nb-accounts-withid-directdebits-test"              = "Account direct debits list test";
"nb-contracts-insurances-test"                      = "Contract insurances list test";
"nb-contracts-pensions-test"                        = "Contract pensions list test";
"nb-contracts-buildings-test"                       = "Contract building list test";
"nb-settings-test"                                  = "Settings test";
"nb-securities-test"                                = "Securities list test";
"nb-contacts-test"                                  = "Contacts list test";
"nb-messages-test"                                  = "Messages list test";

"btn-payments"                                      = "Payments";
"btn-add-payment"                                   = "Add payment";
"btn-create-payment"                                = "Create payment";
"btn-tests"                                         = "Tests";
"btn-run-tests"                                     = "Run tests";
"btn-cancel-tests"                                  = "Stop tests";

"label-customer-id"                                 = "Customer ID:";
"label-customer-name"                               = "Customer name:";
"label-description"                                 = "Descr.:";
"label-from"                                        = "From:";
"label-to"                                          = "To:";
"label-amount"                                      = "Amount:";
"label-date"                                        = "Date:";
"label-select-all"                                  = "Select all";
"label-unselect-all"                                = "Unselect all";

"label-sender-name"                                 = "Sender name:";
"label-sender-account"                              = "Sender account:";
"label-receiver-name"                               = "Receiver name:";
"label-receiver-account"                            = "Receiver account:";
"label-amount"                                      = "Amount:";
"label-currency"                                    = "Currency:";
"label-count"                                       = "Count:";
"label-otp"                                         = "One time password";

"msg-payment-created"                               = "Payment created with state:";
"msg-signing-failed"                                = "Singning failed.";
"msg-unsupported-authorization-type"                = "Unsupported authorization type.";
"msg-undefined-authorization-type"                  = "Undefined authorization type.";
"msg-signing-success"                               = "Payment sucesfully signed.";


